{
  "_num_labels": 9,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Experience_Level",
    "1": "B-Job_role",
    "2": "B-Skill",
    "3": "O",
    "4": "B-Job_Role",
    "5": "B-Domain"
  },
  "ignore_mismatched_sizes": true,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Domain": 5,
    "B-Experience_Level": 0,
    "B-Job_Role": 4,
    "B-Job_role": 1,
    "B-Skill": 2,
    "O": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.37.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
